{
  "Cream of Mushroom Soup": {
    "categoryID": "1",
    "recipeID": "1",
    "categoryName": "Soup",
    "name": "Cream of Mushroom Soup",
    "description": "A simple type of soup where a basic roux is thinned with cream or milk and then mushrooms and/or mushroom broth are added.",
    "ingredients": "2 tablespoons butter, 1/2 pound sliced fresh mushrooms, 1/4 cup chopped onion, 6 tablespoons all-purpose flour, 1/2 teaspoon salt, 1/8 teaspoon pepper, 2 cans (14-1/2 ounces each) chicken broth, 1 cup half-and-half cream",
    "details": {
      "one": "In a large saucepan, heat butter over medium-high heat; saute mushrooms and onion until tender.",
      "two": "Mix flour, salt, pepper and 1 can broth until smooth; stir into mushroom mixture. Stir in remaining broth. Bring to a boil; cook and stir until thickened, about 2 minutes. Reduce heat; stir in cream. Simmer, uncovered, until flavors are blended, about 15 minutes, stirring occasionally."
    },
    "imageURL": "https://www.budgetbytes.com/wp-content/uploads/2017/09/Creamy-Garlic-Mushroom-Soup-spoon.jpg",
    "detailURL": "/category/1/1",
    "categoryURL": "/category/1"
  },
  "Mexican Chicken Corn Chowder": {
    "categoryID": "1",
    "recipeID": "2",
    "categoryName": "Soup",
    "name": "Mexican Chicken Corn Chowder",
    "description": "A creamy, cheesy, veggie and chicken filled soup that's layered with Mexican flavors.",
    "ingredients": "1-1/2 pounds boneless skinless chicken breasts, 1/2 cup chopped onion, 3 tablespoons butter, 1 to 2 garlic cloves, 1 cup hot water, 2 teaspoons chicken bouillon granules, 1/2 to 1 teaspoon ground cumin, 2 cups half-and-half cream, 2 cups shredded Monterey Jack cheese, 1 can (14-3/4 ounces) cream-style corn, 1 can (4 ounces) chopped green chiles, 1/4 to 1 teaspoon hot pepper sauce, 1 medium tomato",
    "details": {
      "one": "In a Dutch oven, brown chicken and onion in butter until chicken is no longer pink. Add garlic; cook 1 minute longer. Add the water, bouillon and cumin; bring to a boil. Reduce heat; cover and simmer for 5 minutes.",
      "two": "Stir in the cream, cheese, corn, chiles and hot pepper sauce. Cook and stir over low heat until cheese is melted; add tomato. If desired, top with cilantro and tortilla strips."
    },
    "imageURL": "https://myfoodstory.com/wp-content/uploads/2017/11/Instant-Pot-Chicken-Potato-Corn-Chowder-with-Bacon-Pressure-Cooker-Recipe-2.jpg",
    "detailURL": "/category/1/2",
    "categoryURL": "/category/1"
  },
  "Lemony Turkey Rice Soup": {
    "categoryID": "1",
    "recipeID": "3",
    "categoryName": "Soup",
    "name": "Lemony Turkey Rice Soup",
    "description": "A wonderful, light soup perfect for the post-holiday turkey leftovers. It is so friendly when you need a 'light' meal after the heaviness of the holidays.",
    "ingredients": "2 cups diced cooked turkey, 2 cups cooked long grain rice, 1 can (10-3/4 ounces) condensed cream of chicken soup, 1/4 teaspoon pepper, 6 cups chicken broth, 2 tablespoons cornstarch, 1/4 to 1/3 cup lemon juice, 1/4 to 1/2 cup minced fresh cilantro",
    "details": {
      "one": "In a large saucepan, combine first 4 ingredients and 5-1/2 cups broth. Bring to a boil; cook 3 minutes.",
      "two": "In a small bowl, mix cornstarch and remaining broth until smooth; gradually stir into soup. Bring to a boil; cook and stir until thickened, 1-2 minutes. Remove from heat; stir in lemon juice and cilantro."
    },
    "imageURL": "https://www.feedyoursoul2.com/wp-content/uploads/2014/12/20-5001.jpg",
    "detailURL": "/category/1/3",
    "categoryURL": "/category/1"
  },
  "Catherine's Spicy Chicken Soup": {
    "categoryID": "1",
    "recipeID": "4",
    "categoryName": "Soup",
    "name": "Catherine's Spicy Chicken Soup",
    "description": "This is a great recipe that you can fix to your taste! The longer it simmers the better. Top with crushed tortilla chips and shredded cheese.",
    "ingredients": "8 skinless, boneless chicken breast halves, 1 teaspoon ground black pepper, 2 tablespoons dried parsley, 1/2 cup chopped onion, 5 cubes chicken bouillon, 1/2 teaspoon salt, 1/2 teaspoon pepper, 1 (14.5 ounce) can whole peeled tomatoes, 1 (15 ounce) can whole kernel corn, drained, 1 (8 ounce) container sour cream, 3 cups 2% milk, 8 ounces process cheese (Velveeta), 2 green onions",
    "details": {
      "one": "In a large pot over medium heat, combine water, chicken, salt, pepper, garlic powder, parsley, onion powder and bouillon cubes. Bring to a boil, then reduce heat and simmer 1 hour, or until chicken juices run clear. Remove chicken, reserve broth. Shred chicken.",
      "two": "In a large pot over medium heat, cook onion and garlic in olive oil until slightly browned. Stir in salsa, diced tomatoes, whole tomatoes, tomato soup, chili powder, corn, chili beans, sour cream, shredded chicken and 5 cups broth. Simmer 30 minutes."
    },
    "imageURL": "https://4.bp.blogspot.com/-dIaw8mBROlc/VrO0809JQJI/AAAAAAAAADM/J40SkJfH1RA/s1600/img22.jpg",
    "detailURL": "/category/1/4",
    "categoryURL": "/category/1"
  },
  "Broccoli Cheese Soup": {
    "categoryID": "1",
    "recipeID": "5",
    "categoryName": "Soup",
    "name": "Broccoli Cheese Soup",
    "description": "This is a great, very flavorful soup. Good for serving at luncheons or special gatherings with a quiche. To make this soup a little fancier, add 1 cup sliced mushrooms and 1 cup white wine with the onions.",
    "ingredients": "1 (16 ounce) package frozen chopped broccoli, 2 cans (14-1/2 ounces each) reduced-sodium chicken broth, 2 cups water, 2 garlic cloves, minced, 1 onion, chopped, 1 cup sliced fresh mushrooms, 1 cup heavy whipping cream, 1/4 teaspoon pepper, 1/2 pound bacon strips",
    "details": {
      "one": "In a stockpot, melt butter over medium heat. Cook onion in butter until softened. Stir in broccoli, and cover with chicken broth. Simmer until broccoli is tender, 10 to 15 minutes.",
      "two": "Reduce heat, and stir in cheese cubes until melted. Mix in milk and garlic powder.",
      "three": "In a small bowl, stir cornstarch into water until dissolved. Stir into soup; cook, stirring frequently, until thick."
    },
    "imageURL": "https://www.shugarysweets.com/wp-content/uploads/2017/01/copycat-panera-broccoli-cheese-soup-1-600x400.jpg",
    "detailURL": "/category/1/5",
    "categoryURL": "/category/1"
  },
  "Won Ton Bites": {
    "categoryID": "2",
    "recipeID": "1",
    "categoryName": "Appetizer",
    "name": "Won Ton Bites",
    "description": "Cheesy sausage-based filling in little cups made from baked won ton wrappers. The baked cups and filling may be prepared a day or two in advance (store covered in the refrigerator) and assembled shortly before serving.",
    "ingredients": "1 Tbsp vegetable oil, 1 (16 ounce) package wonton wrappers, 1 pound sausage, 1 cup shredded Monterey Jack cheese, 1 cup shredded Cheddar cheese, 1 cup Ranch-style salad dressing, Kosher salt",
    "details": {
      "one": "Preheat oven to 350 degrees F (175 degrees C). Spray a miniature muffin pan with cooking spray. Insert wonton wrappers into the muffin pan so as to form small cups. Bake 5 minutes in the preheated oven. Allow the baked wrappers to cool. Remove from the pan.",
      "two": "In a medium bowl, mix the sausage, Monterey Jack, Cheddar, black olives and Ranch-style dressing. Fill the baked wonton wrapper cups with the mixture. Bake the filled wonton wrappers 10 to 15 minutes, until the sausage mixture is bubbly and slightly brown. Watch closely so the wonton wrappers do not burn."
    },
    "imageURL": "https://thecozyapron.com/wp-content/uploads/2015/09/thai-chicken-salad-wonton-cups_thecozyapron_09-20-15_1.jpg",
    "detailURL": "/category/2/1",
    "categoryURL": "/category/2"
  },
  "Guacamole": {
    "categoryID": "2",
    "recipeID": "2",
    "categoryName": "Appetizer",
    "name": "Guacamole",
    "description": "A yummy avocado salad - you can make it smooth or chunky depending on your tastes.",
    "ingredients": "1/4 cup cashew or peanut butter, 3 avocados - peeled, pitted, and mashed, 2 tablespoons lime juice, 1 teaspoon sesame oil, 2 roma (plum) tomatoes, diced, 2 to 5 tablespoons water, ½ cup diced onion, mix of peppers, 2 scallions, 1/2 cup chopped cilantro, 1/2 cup fresh basil and/or mint, 2 Thai chiles or 1 serrano pepper, Sea salt",
    "details": {
      "one": "In a medium bowl, mash together the avocados, lime juice, and salt. Mix in onion, cilantro, tomatoes, and garlic.",
      "two": "Stir in cayenne pepper. Refrigerate 1 hour for best flavor, or serve immediately."
    },
    "imageURL": "https://www.cookingclassy.com/wp-content/uploads/2018/01/guacamole-12.jpg",
    "detailURL": "/category/2/2",
    "categoryURL": "/category/2"
  },
  "Creamy Potato Salad": {
    "categoryID": "2",
    "recipeID": "3",
    "categoryName": "Appetizer",
    "name": "Creamy Potato Salad",
    "description": "It pairs perfectly with any grill, barbeque or potluck entrée, making this go-to side dish for any warm weather get-together.",
    "ingredients": "1 1/2 pounds round red or white potatoes (about 6 medium), 1 1/2 cups mayonnaise or salad dressing, 1 tablespoon white or cider vinegar, 1 tablespoon yellow mustard, 1 teaspoon salt, 1/4 teaspoon pepper, 2 medium stalks celery, 1 medium onion, 4 hard-cooked eggs, Paprika",
    "details": {
      "one": "Place potatoes in 3-quart saucepan; add enough water to cover potatoes. Cover and heat to boiling; reduce heat to low. Cook covered 25 to 30 minutes or until potatoes are tender; drain. Let stand until cool enough to handle. Cut potatoes into cubes.",
      "two": "Mix mayonnaise, vinegar, mustard, salt and pepper in large glass or plastic bowl.",
      "three": "Add potatoes, celery and onion; toss. Stir in eggs. Sprinkle with paprika. Cover and refrigerate at least 4 hours to blend flavors and chill. Store covered in refrigerator."
    },
    "imageURL": "https://www.fromachefskitchen.com/wp-content/uploads/2019/06/Cool-and-Creamy-Potato-Salad.jpg",
    "detailURL": "/category/2/3",
    "categoryURL": "/category/2"
  },
  "Cheese Stuffed Mushroom": {
    "categoryID": "2",
    "recipeID": "4",
    "categoryName": "Appetizer",
    "name": "Cheese Stuffed Mushroom",
    "description": "This easy and elegant appetizer will be devoured at any party. Tender mushroom caps are filled with crispy panko, fresh herbs, and a double dose of cheese for the perfect pre-dinner bite.",
    "ingredients": "24 (2-inch wide) cremini or white button mushrooms (about 1 pound), 3 tablespoons olive oil, 3/4 teaspoon kosher salt, 1/2 teaspoon freshly ground black pepper, 2 small stalks celery, 1 small shallot, 1/4 cup chopped fresh parsley leaves, 2 ounces whole-milk low-moisture mozzarella cheese, 1 ounce Parmesan cheese, 1/4 teaspoon garlic powder, Pinch red pepper flakes (optional), 1/4 cup dry white wine or low-sodium vegetable broth, 1 cup panko breadcrumbs, 1 large egg",
    "details": {
      "one": "Heat two large skillets over medium-high heat, melt 3 tablespoons of butter in each of the skillets and divide the mushroom caps between the two. Cook and stir the mushroom caps until the edges are slightly soft, about 5 minutes. Place the mushrooms in a colander to drain and cool.",
      "two": "In a medium skillet over medium heat, melt butter. Add chopped mushrooms stems and cook until most of the moisture is out, 5 minutes. Add garlic and cook until fragrant, 1 minute then add breadcrumbs and let toast slightly, 3 minutes. Season with salt and pepper. Remove from heat and let cool slightly.",
      "three": "In a large bowl mix together mushroom stem mixture, Parmesan, cream cheese, parsley, and thyme. Season with salt and pepper.  Fill mushroom caps with filling and sprinkle with more Parmesan.",
      "four": "Place the pan of mushrooms in the preheated oven to broil until golden brown, about 5 minutes."
    },
    "imageURL": "https://assets.kraftfoods.com/recipe_images/opendeploy/126812_640x428.jpg",
    "detailURL": "/category/2/4",
    "categoryURL": "/category/2"
  },
  "Bacon Cheddar Deviled Eggs": {
    "categoryID": "2",
    "recipeID": "5",
    "categoryName": "Appetizer",
    "name": "Bacon Cheddar Deviled Eggs",
    "description": "A go-to party snack. Three of delicious foods—bacon, eggs and cheese—come together in these deviled eggs.",
    "ingredients": "12 hard-boiled large eggs, 1/2 cup mayonnaise, 4 bacon strips, 2 tablespoons finely shredded cheddar cheese, 1 tablespoon honey mustard, 1/4 teaspoon pepper",
    "details": {
      "one": "Place eggs in a saucepan, and cover with cold water. Bring water to a boil and immediately remove from heat. Cover, and let eggs stand in hot water for 10 to 12 minutes. Remove from hot water, and cool. To cool more quickly, rinse eggs under cold running water.",
      "two": "Meanwhile, place bacon in a large, deep skillet. Cook over medium-high heat until evenly brown. Alternatively, wrap bacon in paper towels and cook in the microwave for about 1 minute per slice. Crumble and set aside.",
      "three": "Peel the hard-cooked eggs, and cut in half lengthwise. Remove yolks to a small bowl. Mash egg yolks with mayonnaise, crumbled bacon and cheese. Stir in mustard. Fill egg white halves with the yolk mixture and refrigerate until serving."
    },
    "imageURL": "https://assets.kraftfoods.com/recipe_images/opendeploy/157029_640x428.jpg",
    "detailURL": "/category/2/5",
    "categoryURL": "/category/2"
  },
  "Seared Sea Scallops": {
    "categoryID": "3",
    "recipeID": "1",
    "categoryName": "Main Course",
    "name": "Seared Sea Scallops",
    "description": "Seared on the outside with a light crust and tender on the inside. You may vary the amounts of all seasonings to suit your taste.",
    "ingredients": "½ teaspoon dried oregano, 1 1/2 teaspoons kosher salt, 1 1/4 teaspoon freshly ground black pepper, 4 tablespoons extra-virgin olive oil, 4 teaspoons lemon juice, divided, 3 sprigs rosemary, 16 sea scallops, rinsed and drained, 1 cup (loosely packed) parsley leaves",
    "details": {
      "one": "In a large bowl, mix together flour, salt, oregano, thyme and lemon pepper. Roll scallops in flour mixture until lightly coated on all sides.",
      "two": "Heat olive oil in a skillet or frying pan over high heat. Add 4 scallops to the pan and sear on all sides (about 2 minutes for each side). After turning scallops, add 1 tablespoon parsley and 1 teaspoon lemon juice.",
      "three": "Remove scallops from pan and place on a plate in the oven to keep warm until ready to serve.",
      "four": "Repeat until remaining scallops are cooked, tossing each batch with parsley and lemon juice."
    },
    "imageURL": "https://www.culinaryhill.com/wp-content/uploads/2020/02/Pan-Seared-Scallops-with-Lemon-Butter-Culinary-Hill-LR-09SQ.jpg",
    "detailURL": "/category/3/1",
    "categoryURL": "/category/3"
  },
  "Lemon Thyme Chicken Tenders": {
    "categoryID": "3",
    "recipeID": "2",
    "categoryName": "Main Course",
    "name": "Lemon Thyme Chicken Tenders",
    "description": "How great is this? Delicious. Colorful. Nutritious. All presented beautifully on a single platter.",
    "ingredients": "4 skin-on and bone-in chicken thighs, Kosher salt, 4 garlic cloves, 3 tablespoons fresh lemon juice, 5 tablespoons olive oil, 6 sprigs fresh thyme, leaves stripped and chopped, 3 large sprigs rosemary, 1 blood orange, 1 15-ounce can chickpeas, 1/2 cup Castelvetrano olives, 3 ounces feta",
    "details": {
      "one": "Combine the olive oil, garlic, chopped thyme, lemon zest, and lemon juice in a large mixing bowl.",
      "two": "Season the chicken tenders with salt and pepper. Toss chicken with the olive oil mixture; allow to marinate for 5 minutes.",
      "three": "Spray a non-stick skillet with cooking spray, and place over medium-high heat.",
      "four": "Cook chicken tenders in the hot pan until lightly browned and cooked through, about 4 minutes per side."
    },
    "imageURL": "https://chefjulieyoon.com/wp-content/uploads/2011/05/HerbChickenTenders-201.jpg",
    "detailURL": "/category/3/2",
    "categoryURL": "/category/3"
  },
  "Chile-Marinated Pork with Vietnamese Brussels Sprouts": {
    "categoryID": "3",
    "recipeID": "3",
    "categoryName": "Main Course",
    "name": "Chile-Marinated Pork with Vietnamese Brussels Sprouts",
    "description": "The chile paste gives the pork a great kick, while the salty, pungent fish sauce brings out the umami in the Brussels sprouts.",
    "ingredients": "5 1/2 tablespoons vegetable oil, 2 tablespoons rice wine vinegar, 1 1/2 tablespoons soy sauce, 3 garlic cloves, 2 teaspoons finely grated ginger, 1 1/2 tablespoon hot chile paste, 3/4 teaspoon kosher salt, 2 pork tenderloins (each about 1 pound), 2 tablespoons fish sauce, 2 tablespoons lime juice, 1/2 teaspoon honey, 1/2 to 1 red Thai chile pepper, 1 1/2 tablespoons finely chopped roasted unsalted peanuts, 1 1/2 pounds Brussels sprouts, 3/4 cup low-sodium chicken broth or water, 1 tablespoon butter, 1 tablespoon roughly chopped mint",
    "details": {
      "one": "Preheat oven to 400°F. In a medium bowl, whisk together 2 tablespoons oil, vinegar, soy sauce, 2 grated garlic cloves, ginger, chile paste, and 1/4 teaspoon salt. Place pork in a large resealable plastic bag and pour marinade over, tossing to coat. Marinate for 30 minutes at room temperature.",
      "two": "In a small bowl, whisk together remaining 1 grated garlic clove, fish sauce, lime, honey, chile pepper, peanuts, and 1 tablespoon water. Set aside. On a rimmed baking sheet, toss Brussels sprouts with 1 1/2 tablespoons oil and 1/2 teaspoon salt. Roast 15 minutes, then toss. Continue to roast until browned and cooked through, 10 to 15 minutes more. Transfer to a large bowl and toss with 2 tablespoons of the vinaigrette. Taste and add more vinaigrette, if desired.",
      "three": "Meanwhile, heat a large skillet with 2 tablespoons oil over medium-high heat. Remove pork from marinade (reserve marinade) and sear on 3 sides until lightly browned, about 3 minutes per side. Turn tenderloins onto their fourth side and add broth to pan. Transfer skillet to oven and roast pork, basting occasionally, until internal temperature reaches 140°F for medium rare or 145°F for medium, 10 to 13 minutes more (temperature will rise by about 10 degrees after cooking). Transfer pork to cutting board and let rest 5 minutes, and reserve skillet.",
      "four": "Add reserved marinade to the skillet and reduce over medium heat, stirring and scraping up the browned bits, until thickened to a pan sauce that coats the back of a spoon, 3 to 5 minutes. Remove from heat and whisk in butter. Taste and adjust seasoning. To serve, slice pork and drizzle with pan sauce. Spoon Brussels sprouts onto plate, sprinkle with mint, and serve additional pan sauce on side."
    },
    "imageURL": "https://assets.epicurious.com/photos/5a2ac5a827dfe52f3100bcf8/2:1/w_1260%2Ch_630/CHILE-MARINATED-PORK-WITH-VIETNAMESE-BRUSSELS-SPROUTS-cook-90-07122017.jpg",
    "detailURL": "/category/3/3",
    "categoryURL": "/category/3"
  },
  "Sweet Glazed Salmon": {
    "categoryID": "3",
    "recipeID": "4",
    "categoryName": "Main Course",
    "name": "Sweet Glazed Salmon",
    "description": "This honey glazed salmon is seared salmon fillets topped in a honey, soy sauce and garlic glaze.",
    "ingredients": "2 tablespoons extra-virgin olive oil, 1 onion, 1 teaspoon honey, Kosher salt, 1/4 cup drained capers, 1/4 cup raisins, 1/3 teaspoon packed brown sugar, 2 tablespoons fresh lime juice, 4 (6-ounce) salmon fillets, Freshly ground black pepper, 4 tablespoons coarsely chopped cilantro, Lime wedges (for serving)",
    "details": {
      "one": "Heat 1/4 teaspoon olive oil in a small skillet over medium-high heat. Saute garlic in hot oil until just beginning to brown.",
      "two": "Mix sauteed garlic, soy sauce, lemon juice, honey, 1/2 teaspoon olive oil, brown sugar, sea salt, black pepper, and red pepper flakes together in a bowl; pour into a large resealable plastic bag. Add salmon fillets, turning to coat with the marinade, squeeze bag to remove excess air, and seal the bag. Marinate in the refrigerator for 1 hour.",
      "three": "Remove salmon from the marinade and shake to remove excess liquid. Reserve 3 tablespoons marinade and discard remainder.",
      "four": "Heat 1 tablespoon olive oil in a large skillet over medium heat. Arrange salmon fillets in the hot skillet, pour reserved marinade over the salmon, and place a lid on the skillet; cook until salmon is browned on each side and flakes easily with a fork, occasionally spooning liquid from the pan over the fillets, 2 to 3 minutes per side. Garnish salmon with additional sea salt and black pepper."
    },
    "imageURL": "https://recipetineats.com/wp-content/uploads/2017/10/Lemon-Honey-Glazed-Salmon-4.jpg",
    "detailURL": "/category/3/4",
    "categoryURL": "/category/3"
  },
  "Roasted Rack of Lamb": {
    "categoryID": "3",
    "recipeID": "5",
    "categoryName": "Main Course",
    "name": "Roasted Rack of Lamb",
    "description": "The lamb is flavorful and the sauces are delicious.",
    "ingredients": "1 yellow onion (6 oz.), 7 cloves garlic, 2 tablespoons roughly chopped rosemary, 1 tablespoon Dijon mustard, 2 1/2 teaspoons salt, 2/3 cup olive oil, 1 (7 bone) rack of lamb, trimmed and frenched, 1 red onion (6 oz.)",
    "details": {
      "one": "Preheat oven to 450 degrees F (230 degrees C). Move oven rack to the center position.",
      "two": "In a large bowl, combine bread crumbs, garlic, rosemary, 1 teaspoon salt and 1/4 teaspoon pepper. Toss in 2 tablespoons olive oil to moisten mixture. Set aside.",
      "three": "Season the rack all over with salt and pepper. Heat 2 tablespoons olive oil in a large heavy oven proof skillet over high heat. Sear rack of lamb for 1 to 2 minutes on all sides. Set aside for a few minutes. Brush rack of lamb with the mustard. Roll in the bread crumb mixture until evenly coated. Cover the ends of the bones with foil to prevent charring.",
      "four": "Arrange the rack bone side down in the skillet. Roast the lamb in preheated oven for 12 to 18 minutes, depending on the degree of doneness you want. With a meat thermometer, take a reading in the center of the meat after 10 to 12 minutes and remove the meat, or let it cook longer, to your taste. Let it rest for 5 to 7 minutes, loosely covered, before carving between the ribs."
    },
    "imageURL": "https://www.sweetandsavorybyshinee.com/wp-content/uploads/2014/01/Roasted-Rack-of-Lamb-1.jpg",
    "detailURL": "/category/3/5",
    "categoryURL": "/category/3"
  },
  "Chicken Nuggets": {
    "categoryID": "4",
    "recipeID": "1",
    "categoryName": "Snack",
    "name": "Chicken Nuggets",
    "description": "A real kid-pleaser! Adults will enjoy this recipe for a tasty snack, too! Serve warm with your favorite dipping sauces if desired.",
    "ingredients": "1/2 cup all-purpose flour, 1 teaspoon granulated garlic, Kosher salt and ground black pepper, 32 oz boneless, skinless chicken breasts, 1 cup prepared breadcrumbs, 1 large egg, 1 cup vegetable oil",
    "details": {
      "one": "Place the flour in a resealable plastic bag and season with the garlic, 1 teaspoon salt and 1/4 teaspoon pepper. Place the chicken pieces in the bag with the flour and toss to coat (work in batches). Transfer the breadcrumbs to a rimmed plate, season with salt and pepper and set aside.",
      "two": "Whisk the egg and 1 tablespoon water in a medium bowl. Remove a piece of chicken from the flour, dip in the egg mixture, then the breadcrumbs, gently pressing the crumbs into the chicken, and set on a clean plate. Repeat with the remaining pieces of chicken.",
      "three": "Heat the vegetable oil in a large frying pan over medium-high heat. Add the chicken pieces to the pan (work in batches if needed) and brown on each side, about 8 minutes total. Use a spatula to transfer the chicken nuggets to a paper-towel-lined plate. Salt while hot and serve."
    },
    "imageURL": "https://assets.tmecosys.com/image/upload/t_web767x639/img/recipe/ras/Assets/9D900DB3-435D-4AE4-9375-B152D2813750/Derivates/199C60FC-C264-43A3-B822-88AA5E50E954.jpg",
    "detailURL": "/category/4/1",
    "categoryURL": "/category/4"
  },
  "Old Fashioned Onion Rings": {
    "categoryID": "4",
    "recipeID": "2",
    "categoryName": "Snack",
    "name": "Old Fashioned Onion Rings",
    "description": "This is an actual recipe from a former employee of a popular drive-in restaurant. Crispy coated onion rings like the pro's make!",
    "ingredients": "Extra-virgin olive oil, Sea salt and freshly ground black pepper, 1 large onion, cut into 1/4-inch slices, 1 cups all-purpose flour, 1 teaspoon baking powder, 1 egg, 1 cup milk, or as needed, ¾ cup dry bread crumbs",
    "details": {
      "one": "Heat the oil in a deep-fryer to 365 degrees F (185 degrees C). Separate the onion slices into rings, and set aside. In a small bowl, stir together the flour, baking powder and salt.",
      "two": "Dip the onion slices into the flour mixture until they are all coated; set aside. Whisk the egg and milk into the flour mixture using a fork. Dip the floured rings into the batter to coat, then place on a wire rack to drain until the batter stops dripping. The wire rack may be placed over a sheet of aluminum foil for easier clean up. Spread the bread crumbs out on a plate or shallow dish. Place rings one at a time into the crumbs, and scoop the crumbs up over the ring to coat. Give it a hard tap as you remove it from the crumbs. The coating should cling very well. Repeat with remaining rings.",
      "three": "Deep fry the rings a few at a time for 2 to 3 minutes, or until golden brown. Remove to paper towels to drain. Season with seasoning salt, and serve."
    },
    "imageURL": "https://www.mylatinatable.com/wp-content/uploads/2016/01/foto-heroe-1024x693-1-1024x693.jpg",
    "detailURL": "/category/4/2",
    "categoryURL": "/category/4"
  },
  "French Fries": {
    "categoryID": "4",
    "recipeID": "3",
    "categoryName": "Snack",
    "name": "French Fries",
    "description": "Perfectly golden and crisp and deliciously fluffy and tender inside. Just the way the best french fries should be and without the extra fat from deep frying and without a trip to the drive-thru!",
    "ingredients": "12 cups grapeseed or canola oil, 3 large russet potatoes, Kosher salt",
    "details": {
      "one": "Soak potatoes in a large bowl of water for about 30 minutes. Pat dry thoroughly with paper towels.",
      "two": "Heat oil in a deep-fryer or large saucepan to 275 degrees F (135 degrees C). Gently add the potatoes in the hot oil for about 5 minutes, stirring and flipping the potatoes occasionally. Remove potatoes from oil with a slotted spoon to drain on paper towel and to cool completely.",
      "three": "Heat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C). Fry the potatoes again until golden brown, 5 to 6 minutes. Blot with a paper towel. Sprinkle with salt to serve."
    },
    "imageURL": "https://thumbor.thedailymeal.com/Kqs10n_zoYMq7a3i6r7frrm6aXk=/870x565/filters:focal(585x390:586x391)/https://www.thedailymeal.com/sites/default/files/recipe/2017/shutterstock_510881971.jpg",
    "detailURL": "/category/4/3",
    "categoryURL": "/category/4"
  },
  "Boneless Buffalo Wings": {
    "categoryID": "4",
    "recipeID": "4",
    "categoryName": "Snack",
    "name": "Boneless Buffalo Wings",
    "description": "What a great way to have chicken. Had these boneless wings a while back at a pub and fell in love with the taste. A nice change from your regular chicken wings. Serve with blue cheese dressing for dipping",
    "ingredients": "2 lb. chicken wings, 2 tbsp olive oil, 1 tsp garlic powder, Kosher salt,Freshly ground black pepper, 1/4 c hot sauce, 2 tbsp honey, ½ teaspoon paprika, 4 tbsp butter, Ranch dressing, Carrot sticks, Celery sticks, for serving",
    "details": {
      "one": "Heat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).",
      "two": "Combine flour, salt, black pepper, cayenne pepper, garlic powder, and paprika in a large bowl. Whisk together the egg and milk in a small bowl. Dip each piece of chicken in the egg mixture, and then roll in the flour blend. Repeat so that each piece of chicken is double coated. Refrigerate breaded chicken for 20 minutes.",
      "three": "Fry chicken in the hot oil, in batches. Cook until the exterior is nicely browned, and the juices run clear, 5 to 6 minutes a batch. Combine hot sauce and butter in a small bowl. Microwave sauce on High until melted, 20 to 30 seconds. Pour sauce over the cooked chicken; mix to coat."
    },
    "imageURL": "https://dinnerthendessert.com/wp-content/uploads/2018/08/Boneless-Buffalo-Wings-3.jpg",
    "detailURL": "/category/4/4",
    "categoryURL": "/category/4"
  },
  "Coconut Shrimp": {
    "categoryID": "4",
    "recipeID": "5",
    "categoryName": "Snack",
    "name": "Coconut Shrimp",
    "description": "These crispy shrimp are rolled in a coconut beer batter before frying. For dipping sauce, you can use orange marmalade, mustard and horseradish mixed to taste.",
    "ingredients": "1 egg, 1/2 cup all-purpose flour, 2/3 cup beer, 1 1/2 teaspoons baking powder, 1/4 cup all-purpose flour, 2 cups flaked coconut, 24 shrimp, 3 cups oil for frying",
    "details": {
      "one": "In medium bowl, combine egg, 1/2 cup flour, beer and baking powder. Place 1/4 cup flour and coconut in two separate bowls.",
      "two": "Hold shrimp by tail, and dredge in flour, shaking off excess flour. Dip in egg/beer batter; allow excess to drip off. Roll shrimp in coconut, and place on a baking sheet lined with wax paper. Refrigerate for 30 minutes. Meanwhile, heat oil to 350 degrees F (175 degrees C) in a deep-fryer.",
      "three": "Fry shrimp in batches: cook, turning once, for 2 to 3 minutes, or until golden brown. Using tongs, remove shrimp to paper towels to drain. Serve warm with your favorite dipping sauce."
    },
    "imageURL": "https://weelicious.com/imager/weelicious_com/uploads/Coconut-Baked-Shrimp-4_1b74faffbe944b0675f0e20473d3ad34.jpg",
    "detailURL": "/category/4/5",
    "categoryURL": "/category/4"
  },
  "Red Velvet Cake": {
    "categoryID": "5",
    "recipeID": "1",
    "categoryName": "Dessert",
    "name": "Red Velvet Cake",
    "description": "This recipe produces the best red velvet cake with superior buttery, vanilla, and cocoa flavors, as well as a delicious tang from buttermilk.",
    "ingredients": "1/2 cup shortening, 1 1/2 cups white sugar, 2 eggs, 2 tablespoons cocoa, 4 tablespoons red food coloring, 1 teaspoon salt, 1 teaspoon vanilla extract, 1 cup buttermilk, 2 1/2 cups sifted all-purpose flour, 1 1/2 teaspoons baking soda, 1 tablespoon distilled white vinegar, 5 tablespoons all-purpose flour, 1 cup milk, 1 cup white sugar, 1 cup butter, 1 teaspoon vanilla extract",
    "details": {
      "one": "Preheat oven to 350 degrees F (175 degrees C). Grease two 9-inch round pans. Beat shortening and 1 1/2 cups sugar until very light and fluffy. Add eggs and beat well.",
      "two": "Make a paste of cocoa and red food coloring; add to creamed mixture. Mix salt, 1 teaspoon vanilla, and buttermilk together. Add the flour to the batter, alternating with the buttermilk mixture, mixing just until incorporated. Mix soda and vinegar and gently fold into cake batter. Don't beat or stir the batter after this point.",
      "three": "Pour batter into prepared pans. Bake in preheated oven until a tester inserted into the cake comes out clean, about 30 minutes. Cool cakes completely on wire rack.",
      "four": "To Make Icing: Cook 5 tablespoons flour and milk over low heat till thick, stirring constantly. Let cool completely! While mixture is cooling, beat 1 cup sugar, butter, and 1 teaspoon vanilla until light and fluffy. Add cooled flour mixture and beat until frosting is a good spreading consistency. Frost cake layers when completely cool."
    },
    "imageURL": "https://www.telegraph.co.uk/content/dam/recipes/2020/03/06/TELEMMGLPICT000225955887_trans_NvBQzQNjv4Bq0pnPhQHCKLs6Zs8HFVbCRfAW1VMtAeeMa0kMGgcJ8Qw.jpeg?imwidth=450",
    "detailURL": "/category/5/1",
    "categoryURL": "/category/5"
  },
  "Chocolate Brownies": {
    "categoryID": "5",
    "recipeID": "2",
    "categoryName": "Dessert",
    "name": "Chocolate Brownies",
    "description": "The Best Brownie Recipe Ever has the perfect chewy fudge squares of chocolate. You’ll never buy a boxed brownie mix again!",
    "ingredients": "1/2 cup butter, 1 cup white sugar, 2 eggs, 1 teaspoon vanilla extract, 1/3 cup unsweetened cocoa powder, 1/2 cup all-purpose flour, 1/4 teaspoon salt, 1/4 teaspoon baking powder, 3 tablespoons butter, 3 tablespoons unsweetened cocoa powder, 1 tablespoon honey, 1 teaspoon vanilla extract, 1 cup confectioners' sugar",
    "details": {
      "one": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour an 8-inch square pan.",
      "two": "In a large saucepan, melt 1/2 cup butter. Remove from heat, and stir in sugar, eggs, and 1 teaspoon vanilla. Beat in 1/3 cup cocoa, 1/2 cup flour, salt, and baking powder. Spread batter into prepared pan.",
      "three": "Bake in preheated oven for 25 to 30 minutes. Do not overcook.",
      "four": "To Make Frosting: Combine 3 tablespoons softened butter, 3 tablespoons cocoa, honey, 1 teaspoon vanilla extract, and 1 cup confectioners' sugar. Stir until smooth. Frost brownies while they are still warm."
    },
    "imageURL": "https://img.taste.com.au/kdMbjArS/taste/2010/01/chocolate-brownies-118925-2.jpg",
    "detailURL": "/category/5/2",
    "categoryURL": "/category/5"
  },
  "Tiramisu": {
    "categoryID": "5",
    "recipeID": "3",
    "categoryName": "Dessert",
    "name": "Tiramisu",
    "description": "A classic no-bake Italian dessert combining espresso-dipped ladyfingers and a creamy lightly sweetened mascarpone cream.",
    "ingredients": "6 egg yolks, 3/4 cup white sugar, 2/3 cup milk, 1 1/4 cups heavy cream, 1/2 teaspoon vanilla extract, 1 pound mascarpone cheese, 1/4 cup strong brewed coffee, 2 tablespoons rum, 2 (3 ounce) packages ladyfinger cookies, 1 tablespoon unsweetened cocoa powder",
    "details": {
      "one": "In a medium saucepan, whisk together egg yolks and sugar until well blended. Whisk in milk and cook over medium heat, stirring constantly, until mixture boils. Boil gently for 1 minute, remove from heat and allow to cool slightly. Cover tightly and chill in refrigerator 1 hour.",
      "two": "In a medium bowl, beat cream with vanilla until stiff peaks form. Whisk mascarpone into yolk mixture until smooth.",
      "three": "In a small bowl, combine coffee and rum. Split ladyfingers in half lengthwise and drizzle with coffee mixture.",
      "four": "Arrange half of soaked ladyfingers in bottom of a 7x11 inch dish. Spread half of mascarpone mixture over ladyfingers, then half of whipped cream over that. Repeat layers and sprinkle with cocoa. Cover and refrigerate 4 to 6 hours, until set."
    },
    "imageURL": "https://static01.nyt.com/images/2017/04/05/dining/05COOKING-TIRAMISU1/05COOKING-TIRAMISU1-articleLarge.jpg",
    "detailURL": "/category/5/3",
    "categoryURL": "/category/5"
  },
  "Caramel Pudding": {
    "categoryID": "5",
    "recipeID": "4",
    "categoryName": "Dessert",
    "name": "Caramel Pudding",
    "description": "Only 5 ingredients are needed to make this rich and flavorful caramel pudding. This make-ahead dessert is sure to be a family favorite.",
    "ingredients": "2 cups whole milk, 2 tablespoons cornstarch, 1 large egg, 2/3 cup sugar, 2 teaspoons vanilla",
    "details": {
      "one": "In a bowl, whisk 1/2 cup milk, cornstarch, and egg until well blended.",
      "two": "In a 2- to 3-quart pan over medium-high heat, tilt and swirl sugar until melted and deep amber, about 4 minutes. Stir in remaining 1 1/2 cups milk; mixture will bubble and sugar will harden. Stir until sugar melts again, about 2 minutes.",
      "three": "Whisk about 1/2 cup of the caramelized sugar mixture into cornstarch mixture, then return all to pan. Stir over medium-high heat until pudding thickens and begins to bubble, 3 to 5 minutes. Remove from heat and stir in vanilla. Pour into bowls and serve warm. Or let cool, chill airtight up to 2 days, and serve cold."
    },
    "imageURL": "https://tmbidigitalassetsazure.blob.core.windows.net/rms3-prod/attachments/37/1200x1200/Caramel-Custard_EXPS_DIYD20_3136_E07_29_9b.jpg",
    "detailURL": "/category/5/4",
    "categoryURL": "/category/5"
  },
  "Chocolate Covered Strawberries": {
    "categoryID": "5",
    "recipeID": "5",
    "categoryName": "Dessert",
    "name": "Chocolate Covered Strawberries",
    "description": "This is the simplest version of chocolate covered strawberries I know. They are perfect for weddings when decorated with frosting bow ties, bells, butterflies, roses, etc.",
    "ingredients": "16 ounces milk chocolate chips, 2 tablespoons shortening, 1 pound fresh strawberries with leaves",
    "details": {
      "one": "In a double boiler, melt the chocolate and shortening, stirring occasionally until smooth. Holding them by the toothpicks, dip the strawberries into the chocolate mixture.",
      "two": "Insert toothpicks into the tops of the strawberries.",
      "three": "Turn the strawberries upside down and insert the toothpick into styrofoam for the chocolate to cool."
    },
    "imageURL": "https://www.cookingclassy.com/wp-content/uploads/2020/01/chocolate-covered-strawberries-13.jpg",
    "detailURL": "/category/5/5",
    "categoryURL": "/category/5"
  }
}
